use super::super::super::{core::core_utils::utils, dto::config_global_dto::ConfigGlobalDTO};
use crate::commands::command_trait::cmd_trait::ICommand;
use clap::{Arg, ArgAction, Command};
use colored::*;

pub struct CommandInfo;

impl ICommand for CommandInfo {
    fn new() -> Self {
        Self
    }

    fn arg() -> Arg {
        Arg::new("info")
            .long("info")
            .short('i')
            .action(ArgAction::SetTrue)
            .help("Displays detailed information for the Nest4d CLI.")
    }

    fn command() -> Command {
        Command::new("")
    }

    fn execute(_global_dto: &mut ConfigGlobalDTO, _matches: &clap::ArgMatches) {
        let print_text: Vec<String> = vec![
            "".to_string(),
            "    ███████    ███████████   ██████   ██████ ███████████                 █████████  █████       █████".to_string(),
            "   ███░░░░░███ ░░███░░░░░███ ░░██████ ██████ ░░███░░░░░███               ███░░░░░███░░███       ░░███".to_string(), 
            "  ███     ░░███ ░███    ░███  ░███░█████░███  ░███    ░███ ████████     ███     ░░░  ░███        ░███".to_string(),
            " ░███      ░███ ░██████████   ░███░░███ ░███  ░██████████ ░░███░░███   ░███          ░███        ░███".to_string(),
            " ░███      ░███ ░███░░░░░███  ░███ ░░░  ░███  ░███░░░░░███ ░███ ░░░    ░███          ░███        ░███".to_string(),
            " ░░███     ███  ░███    ░███  ░███      ░███  ░███    ░███ ░███        ░░███     ███ ░███      █ ░███".to_string(),
            "  ░░░███████░   █████   █████ █████     █████ ███████████  █████        ░░█████████  ███████████ █████".to_string(),
            "    ░░░░░░░    ░░░░░   ░░░░░ ░░░░░     ░░░░░ ░░░░░░░░░░░  ░░░░░          ░░░░░░░░░  ░░░░░░░░░░░ ░░░░░".to_string(),
            format!(
                "  Version: {}",
                utils::version()
            ),
            "  Author: Isaque Pinheiro".to_string(),
            "  Email: isaquesp@gmail.com".to_string(),
            "  Github: https://github.com/HashLoad/Nest4d".to_string(),
            "  Documentation: https://nest4d-en.docs-br.com".to_string(),
            "  Language: Rust".to_string(),
            "".to_string(),
        ];
        println!("{}", &print_text.join("\n").yellow());
    }
}
